In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("datasets/category_data.csv")

In [4]:
df1 = pd.get_dummies(df['Gender'])

In [6]:
df = pd.concat([df , df1] , axis = 1).reindex(df.index)

In [8]:
df.drop('Gender' , axis = 1 , inplace=True)

In [9]:
df

      Name  F  M
0   Aditya  0  1
1  Nameera  1  0
2  Shivani  1  0